---
kind: method
id: M:Autodesk.Revit.DB.DividedSurface.GetAllIntersectionElements
source: html/d2debd59-e78a-e355-a89f-eee8de6f874b.htm
---
# Autodesk.Revit.DB.DividedSurface.GetAllIntersectionElements Method

Gets all intersection elements which produce division lines.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetAllIntersectionElements()
```

## Returns
The intersection elements.